arr_pair=[ [1,2], [3,4], [5,6] ]
print(arr_pair)
arr=[]
for pair in arr_pair:
    arr.append(pair[0])
    arr.append(pair[1])


print(arr)
print(pair)   
#1 разбиваем массив на пары сохраняем  все пары в один обший массив пар
# для этого уже есть код
#если не хватает элементов при разбитии напары добавляем 0
#2 если пар не четное количество то добавляем новую пару из двух нулей
# arr_pair.append([0,0])
#3 переставляем пары метсами так как быдто это обычный массив
#4 объединяем пары кодом выше в единный массив
